axf33480/ESP32CommandStation/src/Interfaces/DCCppProtocol.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses

The DCC++ protocol specification is
COPYRIGHT (c) 2013-2016 Gregg E. Berman
and has been adapter for use in ESP32 COMMAND STATION.

**********************************************************************/

#include "ESP32CommandStation.h"

#include <esp_wifi.h>
#include <esp_wifi_types.h>

vector<unique_ptr<DCCPPProtocolCommand>> registeredCommands;

// <e> command handler, this command will clear all stored Turnouts, Outputs,
// Sensors and S88 Sensors (if enabled) after sending this command. Note, when
// running with the PCB configuration only turnouts will be cleared.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(ConfigErase, "e")
DCC_PROTOCOL_COMMAND_HANDLER(ConfigErase,
[](const vector<string> arguments)
{
  turnoutManager->clear();
#if ENABLE_SENSORS
  SensorManager::clear();
  SensorManager::store();
#if S88_ENABLED
  S88BusManager::clear();
  S88BusManager::store();
#endif
#endif
#if ENABLE_OUTPUTS
  OutputManager::clear();
  OutputManager::store();
#endif
  return COMMAND_SUCCESSFUL_RESPONSE;
})

// <E> command handler, this command stores all currently defined Turnouts,
// Sensors, S88 Sensors (if enabled) and Outputs to persistent storage for use
// by the Command Station in subsequent startups. Note, when running with the
// PCB configuration only turnouts will be stored.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(ConfigStore, "E")
DCC_PROTOCOL_COMMAND_HANDLER(ConfigStore,
[](const vector<string> arguments)
{
  return StringPrintf("<e %d %d %d>"
                    , turnoutManager->getTurnoutCount()
#if ENABLE_SENSORS
                    , SensorManager::store()
#if S88_ENABLED
                    + S88BusManager::store()
#endif
#else
                    , 0
#endif
#if ENABLE_OUTPUTS
                    , OutputManager::store()
#else
                    , 0
#endif
    );
})

// <R {CV} {CALLBACK} {CALLBACK-SUB}> command handler, this command attempts
// to read a CV value from the PROGRAMMING track. The returned value will be
// the actual CV value or -1 when there is a failure reading or verifying the
// CV.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(ReadCVCommand, "R")
DCC_PROTOCOL_COMMAND_HANDLER(ReadCVCommand,
[](const vector<string> arguments)
{
  uint16_t cv = std::stoi(arguments[0]);
  uint16_t callback = std::stoi(arguments[1]);
  uint16_t callbackSub = std::stoi(arguments[2]);
  int16_t value = readCV(cv);
  return StringPrintf("<r%d|%d|%d %d>",
    callback,
    callbackSub,
    cv,
    value);
})

// <W {CV} {VALUE} {CALLBACK} {CALLBACK-SUB}> command handler, this command
// attempts to write a CV value on the PROGRAMMING track. The returned value
// is either the actual CV value written or -1 if there is a failure writing or
// verifying the CV value.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(WriteCVByteProgCommand, "W")
DCC_PROTOCOL_COMMAND_HANDLER(WriteCVByteProgCommand,
[](const vector<string> arguments)
{
  uint16_t cv = std::stoi(arguments[0]);
  int16_t value = std::stoi(arguments[1]);
  uint16_t callback = std::stoi(arguments[2]);
  uint16_t callbackSub = std::stoi(arguments[3]);
  if (!writeProgCVByte(cv, value))
  {
    LOG_ERROR("[PROG] Failed to write CV %d as %d", cv, value);
    value = -1;
  }
  return StringPrintf("<r%d|%d|%d %d>", callback, callbackSub, cv, value);
})

// <W {CV} {BIT} {VALUE} {CALLBACK} {CALLBACK-SUB}> command handler, this
// command attempts to write a single bit value for a CV on the PROGRAMMING
// track. The returned value is either the actual bit value of the CV or -1 if
// there is a failure writing or verifying the CV value.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(WriteCVBitProgCommand, "B")
DCC_PROTOCOL_COMMAND_HANDLER(WriteCVBitProgCommand,
[](const vector<string> arguments)
{
  int cv = std::stoi(arguments[0]);
  uint8_t bit = std::stoi(arguments[1]);
  int8_t value = std::stoi(arguments[2]);
  uint16_t callback = std::stoi(arguments[3]);
  uint16_t callbackSub = std::stoi(arguments[4]);
  if (!writeProgCVBit(cv, bit, value))
  {
    LOG_ERROR("[PROG] Failed to write CV %d BIT %d as %d", cv, bit, value);
    value = -1;
  }
  return StringPrintf("<r%d|%d|%d %d %d>", callback, callbackSub, cv, bit
                    , value);
})

// <w {LOCO} {CV} {VALUE}> command handler, this command sends a CV write packet
// on the MAIN OPERATIONS track for a given LOCO. No verification is attempted.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(WriteCVByteOpsCommand, "w")
DCC_PROTOCOL_COMMAND_HANDLER(WriteCVByteOpsCommand,
[](const vector<string> arguments)
{
  writeOpsCVByte(std::stoi(arguments[0]), std::stoi(arguments[1])
               , std::stoi(arguments[2]));
  return COMMAND_SUCCESSFUL_RESPONSE;
})

// <w {LOCO} {CV} {BIT} {VALUE}> command handler, this command sends a CV bit
// write packet on the MAIN OPERATIONS track for a given LOCO. No verification
// is attempted.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(WriteCVBitOpsCommand, "b")
DCC_PROTOCOL_COMMAND_HANDLER(WriteCVBitOpsCommand,
[](const vector<string> arguments)
{
  writeOpsCVBit(std::stoi(arguments[0]), std::stoi(arguments[1])
              , std::stoi(arguments[2]), arguments[3][0] == '1');
  return COMMAND_SUCCESSFUL_RESPONSE;
})

string convert_loco_to_dccpp_state(TrainImpl *impl, size_t id)
{
  dcc::SpeedType speed(impl->get_speed());
  return StringPrintf("<T %d %d %d>", id, (speed.get_dcc_128() & 0x7F)
                    , speed.direction() == dcc::SpeedType::FORWARD);
}

// <s> command handler, this command sends the current status for all parts of
// the ESP32 Command Station. JMRI uses this command as a keep-alive heartbeat
// command.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(StatusCommand, "s")
DCC_PROTOCOL_COMMAND_HANDLER(StatusCommand,
[](const vector<string> arguments)
{
  wifi_mode_t mode;
  string status = StringPrintf("<iDCC++ %s: V-%s / %s %s>"
                , PROJECT_NAME
                , PROJECT_VER
                , __DATE__
                , __TIME__);
  status += trackSignal->get_state_for_dccpp();
  for (size_t id = 0; id < trainNodes->size(); id++)
  {
    auto nodeid = trainNodes->get_train_node_id(id);
    if (nodeid)
    {
      auto impl = trainNodes->get_train_impl(nodeid);
      status += convert_loco_to_dccpp_state(impl, id);
    }
  }
  status += turnoutManager->get_state_for_dccpp();
#if ENABLE_OUTPUTS
  status += OutputManager::get_state_for_dccpp();
#endif
  if (esp_wifi_get_mode(&mode) == ESP_OK)
  {
    tcpip_adapter_ip_info_t ip_info;
    if (mode == WIFI_MODE_STA || mode == WIFI_MODE_APSTA)
    {
      if (tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_STA, &ip_info) == ESP_OK)
      {
        status += StringPrintf("<N1: " IPSTR ">", IP2STR(&ip_info.ip));
      }
      if (tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ip_info) == ESP_OK)
      {
        status += StringPrintf("<N1: " IPSTR ">", IP2STR(&ip_info.ip));
      }
    }
    else if (mode != WIFI_MODE_NULL &&
             tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ip_info) == ESP_OK)
    {
      status += StringPrintf("<N1: " IPSTR ">", IP2STR(&ip_info.ip));
    }
  }
  return status;
})

// <F> command handler, this command sends the current free heap space as response.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(FreeHeapCommand, "F")
DCC_PROTOCOL_COMMAND_HANDLER(FreeHeapCommand,
[](const vector<string> arguments)
{
  return StringPrintf("<f %d>", os_get_free_heap());
})

