axf33480/ESP32CommandStation/src/Interfaces/DCCppProtocol.cpp
// <estop> command handler, this command sends an estop packet to all active
// locomotives.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(EStopCommand, "estop")
DCC_PROTOCOL_COMMAND_HANDLER(EStopCommand,
[](const vector<string> arguments)
{
  Singleton<esp32cs::EStopHandler>::instance()->set_state(true);
  return COMMAND_SUCCESSFUL_RESPONSE;
})

DECLARE_DCC_PROTOCOL_COMMAND_CLASS(CurrentDrawCommand, "c")
DCC_PROTOCOL_COMMAND_HANDLER(CurrentDrawCommand,
[](const vector<string> arguments)
{
  return trackSignal->get_state_for_dccpp();
})

DECLARE_DCC_PROTOCOL_COMMAND_CLASS(PowerOnCommand, "1")
DCC_PROTOCOL_COMMAND_HANDLER(PowerOnCommand,
[](const vector<string> arguments)
{
  trackSignal->enable_ops_output();
  // hardcoded response since enable/disable is deferred until the next
  // check interval.
  return "<p1 OPS>";
})

DECLARE_DCC_PROTOCOL_COMMAND_CLASS(PowerOffCommand, "0")
DCC_PROTOCOL_COMMAND_HANDLER(PowerOffCommand,
[](const vector<string> arguments)
{
  trackSignal->disable_ops_output();
  // hardcoded response since enable/disable is deferred until the next
  // check interval.
  return "<p0 OPS>";
})

#define GET_LOCO_VIA_EXECUTOR(NAME, address)                                          \
  TrainImpl *NAME = nullptr;                                                          \
  {                                                                                   \
    SyncNotifiable n;                                                                 \
    extern unique_ptr<OpenMRN> openmrn;                                               \
    openmrn->stack()->executor()->add(new CallbackExecutable(                         \
    [&]()                                                                             \
    {                                                                                 \
      NAME = trainNodes->get_train_impl(commandstation::DccMode::DCC_128_LONG_ADDRESS \
                                      , address);                                     \
      n.notify();                                                                     \
    }));                                                                              \
    n.wait_for_notification();                                                        \
  }

// <t {REGISTER} {LOCO} {SPEED} {DIRECTION}> command handler, this command
// converts the provided locomotive control command into a compatible DCC
// locomotive control packet.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(ThrottleCommandAdapter, "t")
DCC_PROTOCOL_COMMAND_HANDLER(ThrottleCommandAdapter,
[](const vector<string> arguments)
{
  int reg_num = std::stoi(arguments[0]);
  uint16_t loco_addr = std::stoi(arguments[1]);
  uint8_t req_speed = std::stoi(arguments[2]);
  uint8_t req_dir = std::stoi(arguments[3]);

  GET_LOCO_VIA_EXECUTOR(impl, loco_addr);

  dcc::SpeedType speed(impl->get_speed());
  speed.set_dcc_128(req_speed);
  speed.set_direction(req_dir ? dcc::SpeedType::FORWARD : dcc::SpeedType::REVERSE);
  impl->set_speed(speed);
  return convert_loco_to_dccpp_state(impl, reg_num);
});

// <tex {LOCO} {SPEED} {DIRECTION}> command handler, this command
// converts the provided locomotive control command into a compatible DCC
// locomotive control packet.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(ThrottleExCommandAdapter, "tex")
DCC_PROTOCOL_COMMAND_HANDLER(ThrottleExCommandAdapter,
[](const vector<string> arguments)
{
  uint16_t loco_addr = std::stoi(arguments[0]);
  int8_t req_speed = std::stoi(arguments[1]);
  int8_t req_dir = std::stoi(arguments[2]);

  GET_LOCO_VIA_EXECUTOR(impl, loco_addr);

  dcc::SpeedType speed(impl->get_speed());
  if (req_speed >= 0)
  {
    speed.set_dcc_128(req_speed);
  }
  if (req_dir >= 0)
  {
    speed.set_direction(req_dir ? dcc::SpeedType::FORWARD : dcc::SpeedType::REVERSE);
  }
  impl->set_speed(speed);
  return convert_loco_to_dccpp_state(impl, 0);
})

// <f {LOCO} {BYTE} [{BYTE2}]> command handler, this command converts a
// locomotive function update into a compatible DCC function control packet.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(FunctionCommandAdapter, "f")
DCC_PROTOCOL_COMMAND_HANDLER(FunctionCommandAdapter,
[](const vector<string> arguments)
{
  uint16_t loco_addr = std::stoi(arguments[0]);
  uint8_t func_byte = std::stoi(arguments[1]);
  uint8_t first{1};
  uint8_t last{4};
  uint8_t bits{func_byte};

  GET_LOCO_VIA_EXECUTOR(impl, loco_addr);

  // check this is a request for functions F13-F28
  if(arguments.size() > 2)
  {
    bits = std::stoi(arguments[2]);
    if((func_byte & 0xDE) == 0xDE)
    {
      first = 13;
      last = 20;
    }
    else
    {
      first = 21;
      last = 28;
    }
  }
  else
  {
    // this is a request for functions FL,F1-F12
    // for safety this guarantees that first nibble of function byte will always
    // be of binary form 10XX which should always be the case for FL,F1-F12
    if((func_byte & 0xB0) == 0xB0)
    {
      first = 5;
      last = 8;
    }
    else if((func_byte & 0xA0) == 0xA0)
    {
      first = 9;
      last = 12;
    }
    else
    {
      impl->set_fn(0, func_byte & BIT(4));
    }
  }
  for(uint8_t id = first; id <= last; id++)
  {
    impl->set_fn(id, bits & BIT(id - first));
  }
  return COMMAND_NO_RESPONSE;
});

// <fex {LOCO} {FUNC} {STATE}]> command handler, this command converts a
// locomotive function update into a compatible DCC function control packet.
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(FunctionExCommandAdapter, "fex")
DCC_PROTOCOL_COMMAND_HANDLER(FunctionExCommandAdapter,
[](const vector<string> arguments)
{
  int loco_addr = std::stoi(arguments[0]);
  int function = std::stoi(arguments[1]);
  int state = std::stoi(arguments[2]);

  GET_LOCO_VIA_EXECUTOR(impl, loco_addr);

  impl->set_fn(function, state);
  return COMMAND_NO_RESPONSE;
});

// wrapper to handle the following command structures:
// CREATE: <C {ID} {LEAD LOCO} {TRAIL LOCO}  [{OTHER LOCO}]>
// DELETE: <C {ID} {LOCO}>
// DELETE: <C {ID}>
// QUERY : <C 0 {LOCO}>
// SHOW  : <C>
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(ConsistCommandAdapter, "C")
DCC_PROTOCOL_COMMAND_HANDLER(ConsistCommandAdapter,
[](const vector<string> arguments)
{
  // TODO: reimplement
  /*
  if (arguments.empty())
  {
    return locoManager->getConsistStateAsDCCpp();
  }
  else if (arguments.size() == 1 &&
           locoManager->removeLocomotiveConsist(std::stoi(arguments[1])))
  {
    return COMMAND_SUCCESSFUL_RESPONSE;
  }
  else if (arguments.size() == 2)
  {
    int8_t consistAddress = std::stoi(arguments[0]);
    uint16_t locomotiveAddress = std::stoi(arguments[1]);
    if (consistAddress == 0)
    {
      // query which consist loco is in
      auto consist = locoManager->getConsistForLoco(locomotiveAddress);
      if (consist)
      {
        return StringPrintf("<V %d %d>",
          consist->legacy_address() * consist->isDecoderAssistedConsist() ? -1 : 1,
          locomotiveAddress);
      }
    }
    else
    {
      // remove loco from consist
      auto consist = locoManager->getConsistByID(consistAddress);
      if (consist->isAddressInConsist(locomotiveAddress))
      {
        consist->removeLocomotive(locomotiveAddress);
        return COMMAND_SUCCESSFUL_RESPONSE;
      }
    }
    // if we get here either the query or remove failed
    return COMMAND_FAILED_RESPONSE;
  }
  else if (arguments.size() >= 3)
  {
    // create or update consist
    uint16_t consistAddress = std::stoi(arguments[0]);
    auto consist = locoManager->getConsistByID(consistAddress);
    if (consist)
    {
      // existing consist, need to update
      consist->releaseLocomotives();
    }
    else
    {
      // verify if all provided locos are not already in a consist
      for(int index = 1; index < arguments.size(); index++)
      {
        int32_t locomotiveAddress = std::stoi(arguments[index]);
        if(locoManager->isAddressInConsist(abs(locomotiveAddress)))
        {
          LOG_ERROR("[Consist] Locomotive %d is already in a consist.", abs(locomotiveAddress));
          return COMMAND_FAILED_RESPONSE;
        }
      }
      consist = locoManager->createLocomotiveConsist(consistAddress);
      if(!consist)
      {
        LOG_ERROR("[Consist] Unable to create new Consist");
        return COMMAND_FAILED_RESPONSE;
      }
    }
    // add locomotives to consist
    for(int index = 1; index < arguments.size(); index++)
    {
      int32_t locomotiveAddress = std::stoi(arguments[index]);
      consist->addLocomotive(abs(locomotiveAddress), locomotiveAddress > 0,
        index - 1);
    }
    return COMMAND_SUCCESSFUL_RESPONSE;
  }
  */
  return COMMAND_FAILED_RESPONSE;
})

