axf33480/ESP32CommandStation/src/Interfaces/DCCppProtocol.cpp
/*
  <T ID BOARD INDEX>:          creates a new turnout ID, with specified BOARD
                               and INDEX. If turnout ID already exists, it is
                               updated with specificed BOARD and INDEX
      returns: <O> if successful and <X> if unsuccessful (ie: out of memory)

  <T ID>:                      deletes definition of turnout ID
      returns: <O> if successful and <X> if unsuccessful (ie: ID does not exist)

  <T>:                         lists all defined turnouts
      returns: <H ID ADDRESS SUBADDRESS THROW> for each defined turnout or <X>
               if no turnouts defined
  <T ID THROW>:                sets turnout ID to either the "thrown" or
                               "unthrown" position
      returns: <H ID THROW>, or <X> if turnout ID does not exist
where
  ID:         the numeric ID (0-32767) of the turnout to control
  BOARD:      the primary address of the decoder controlling this turnout
              (0-511)
  INDEX:      the subaddress of the decoder controlling this turnout (0-3)
  THROW:      0 (unthrown) or 1 (thrown)
*/
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(TurnoutCommandAdapter, "T")
DCC_PROTOCOL_COMMAND_HANDLER(TurnoutCommandAdapter,
[](const vector<string> arguments)
{
  if (arguments.empty())
  {
    // list all turnouts
    return turnoutManager->get_state_for_dccpp();
  }
  else
  {
    uint16_t turnoutID = std::stoi(arguments[0]);
    if (arguments.size() == 1 &&
        turnoutManager->removeByID(turnoutID))
    {
      // delete turnout
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
    else if (arguments.size() == 2)
    {
      // throw turnout
      return turnoutManager->setByID(turnoutID, arguments[1][0] == '1');
    }
    else if (arguments.size() == 3)
    {
      // create/update turnout
      turnoutManager->createOrUpdate(turnoutID, std::stoi(arguments[1])
                                   , std::stoi(arguments[2]));
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
  }
  return COMMAND_FAILED_RESPONSE;
})

/*
  <Tex ID>:              Toggle turnout by ID.
  <Tex ID ADDRESS TYPE>: Creates a Turnout by DCC address
  <Tex ADDRESS TYPE>:    Create a Turnout by DCC address with automatic
                         assignment of ID
  all will return : <O> if successful and <X> if unsuccessful.

where
  ID:         the numeric ID (0-32767) of the turnout to control
  ADDRESS:    the DCC decoder address for the turnout
  TYPE:       turnout type:
              0 : LEFT
              1 : RIGHT
              2 : WYE
              3 : MULTI
*/
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(TurnoutExCommandAdapter, "Tex")
DCC_PROTOCOL_COMMAND_HANDLER(TurnoutExCommandAdapter,
[](const vector<string> arguments)
{
  if (!arguments.empty())
  {
    if (std::stoi(arguments[0]) >= 0)
    {
      if (arguments.size() == 1)
      {
        return turnoutManager->toggleByID(std::stoi(arguments[0]));
      }
      else if (arguments.size() == 3 &&
               turnoutManager->createOrUpdate(std::stoi(arguments[0])
                                            , std::stoi(arguments[1])
                                            , -1
                                            , (TurnoutType)std::stoi(arguments[2])))
      {
        return COMMAND_SUCCESSFUL_RESPONSE;
      }
    }
    else
    {
      auto turnout = turnoutManager->getTurnoutByAddress(std::stoi(arguments[1]));
      if (turnout)
      {
        turnout->setType((TurnoutType)std::stoi(arguments[2]));
        return COMMAND_SUCCESSFUL_RESPONSE;
      }
      else if (turnoutManager->createOrUpdate(turnoutManager->getTurnoutCount() + 1
                                            , std::stoi(arguments[1])
                                            , -1
                                            , (TurnoutType)std::stoi(arguments[2])))
      {
        return COMMAND_SUCCESSFUL_RESPONSE;
      }
    }
  }
  return COMMAND_FAILED_RESPONSE;
})

/*
 <a BOARD INDEX THROW>: Throws a turnout (accessory decoder)
      returns: <H ID THROW>

Note: When this is received a Turnout will be created based on the decoded
DCC address for the accessory decoder.
where
  BOARD:      the primary address of the decoder controlling this turnout
              (0-511)
  INDEX:      the subaddress of the decoder controlling this turnout (0-3)
  THROW:      0 (unthrown) or 1 (thrown)
*/
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(AccessoryCommand, "a")
DCC_PROTOCOL_COMMAND_HANDLER(AccessoryCommand,
[](const vector<string> arguments)
{
  return turnoutManager->setByAddress(
      decodeDCCAccessoryAddress(std::stoi(arguments[0])
                              , std::stoi(arguments[1]))
    , std::stoi(arguments[2])
  );
})

#if ENABLE_SENSORS
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(SensorCommandAdapter, "S")
DCC_PROTOCOL_COMMAND_HANDLER(SensorCommandAdapter,
[](const vector<string> arguments)
{
  if(arguments.empty())
  {
    // list all sensors
    string status = SensorManager::get_state_for_dccpp();
#if S88_ENABLED
    status += S88BusManager::get_state_for_dccpp();
#endif
    status += RemoteSensorManager::get_state_for_dccpp();
    return status;
  }
  else
  {
    uint16_t sensorID = std::stoi(arguments[0]);
    if (arguments.size() == 1 && SensorManager::remove(sensorID))
    {
      // delete turnout
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
    else if (arguments.size() == 3)
    {
      // create sensor
      SensorManager::createOrUpdate(sensorID, std::stoi(arguments[1])
                                  , arguments[2][0] == '1');
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
  }
  return COMMAND_FAILED_RESPONSE;
})

DECLARE_DCC_PROTOCOL_COMMAND_CLASS(RemoteSensorsCommandAdapter, "RS")
DCC_PROTOCOL_COMMAND_HANDLER(RemoteSensorsCommandAdapter,
[](const vector<string> arguments)
{
  if(arguments.empty())
  {
    // list all sensors
    return RemoteSensorManager::get_state_for_dccpp();
  }
  else
  {
    uint16_t sensorID = std::stoi(arguments[0]);
    if (arguments.size() == 1 && RemoteSensorManager::remove(sensorID))
    {
      // delete remote sensor
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
    else if (arguments.size() == 2)
    {
      // create/update remote sensor
      RemoteSensorManager::createOrUpdate(sensorID, std::stoi(arguments[1]));
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
  }
  return COMMAND_FAILED_RESPONSE;
})

#if S88_ENABLED
DCC_PROTOCOL_COMMAND_HANDLER(S88BusCommandAdapter,
[](const vector<string> arguments)
{
  if(arguments.empty())
  {
    // list all sensor groups
    return S88BusManager::get_state_for_dccpp();
  }
  else
  {
    if (arguments.size() == 1 &&
        S88BusManager::removeBus(std::stoi(arguments[0])))
    {
      // delete sensor bus
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
    else if (arguments.size() == 3 &&
             S88BusManager::createOrUpdateBus(std::stoi(arguments[0])
                                            , std::stoi(arguments[1])
                                            , std::stoi(arguments[2])))
    {
      // create sensor bus
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
  }
  return COMMAND_FAILED_RESPONSE;
})
#endif // S88_ENABLED
#endif // SENSORS_ENABLED

#if ENABLE_OUTPUTS
DECLARE_DCC_PROTOCOL_COMMAND_CLASS(OutputCommandAdapter, "Z")
DCC_PROTOCOL_COMMAND_HANDLER(OutputCommandAdapter,
[](const vector<string> arguments)
{
  if(arguments.empty())
  {
    // list all outputs
    return OutputManager::get_state_for_dccpp();
  }
  else
  {
    uint16_t outputID = std::stoi(arguments[0]);
    if (arguments.size() == 1 && OutputManager::remove(outputID))
    {
      // delete output
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
    else if (arguments.size() == 2)
    {
      // set output state
      return OutputManager::set(outputID, arguments[1][0] == 1);
    }
    else if (arguments.size() == 3)
    {
      // create output
      OutputManager::createOrUpdate(outputID, std::stoi(arguments[1])
                                  , std::stoi(arguments[2]));
      return COMMAND_SUCCESSFUL_RESPONSE;
    }
  }
  return COMMAND_FAILED_RESPONSE;
})

DECLARE_DCC_PROTOCOL_COMMAND_CLASS(OutputExCommandAdapter, "Zex")
DCC_PROTOCOL_COMMAND_HANDLER(OutputExCommandAdapter,
[](const vector<string> arguments)
{
  if(arguments.empty())
  {
    return COMMAND_FAILED_RESPONSE;
  }
  else
  {
    uint16_t outputID = std::stoi(arguments[0]);
    auto output = OutputManager::getOutput(outputID);
    if (output)
    {
      return output->set(!output->isActive());
    }
  }
  return COMMAND_FAILED_RESPONSE;
})
#endif // OUTPUTS_ENABLED

