axf33480/ESP32CommandStation/src/Interfaces/DCCppProtocol.cpp
void DCCPPProtocolHandler::init()
{
  registerCommand(new ThrottleCommandAdapter());
  registerCommand(new ThrottleExCommandAdapter());
  registerCommand(new FunctionCommandAdapter());
  registerCommand(new FunctionExCommandAdapter());
  registerCommand(new ConsistCommandAdapter());
  registerCommand(new AccessoryCommand());
  registerCommand(new PowerOnCommand());
  registerCommand(new PowerOffCommand());
  registerCommand(new CurrentDrawCommand());
  registerCommand(new StatusCommand());
  registerCommand(new ReadCVCommand());
  registerCommand(new WriteCVByteProgCommand());
  registerCommand(new WriteCVBitProgCommand());
  registerCommand(new WriteCVByteOpsCommand());
  registerCommand(new WriteCVBitOpsCommand());
  registerCommand(new ConfigErase());
  registerCommand(new ConfigStore());
#if ENABLE_OUTPUTS
  registerCommand(new OutputCommandAdapter());
  registerCommand(new OutputExCommandAdapter());
#endif
  registerCommand(new TurnoutCommandAdapter());
  registerCommand(new TurnoutExCommandAdapter());
#if ENABLE_SENSORS
  registerCommand(new SensorCommandAdapter());
#if S88_ENABLED
  registerCommand(new S88BusCommandAdapter());
#endif
  registerCommand(new RemoteSensorsCommandAdapter());
#endif
  registerCommand(new FreeHeapCommand());
  registerCommand(new EStopCommand());
}

string DCCPPProtocolHandler::process(const string &commandString)
{
  vector<string> parts;
  esp32cs::tokenize(commandString, parts);
  string commandID = parts.front();
  parts.erase(parts.begin());
  LOG(VERBOSE, "Command: %s, argument count: %d", commandID.c_str()
    , parts.size());
  auto handler = getCommandHandler(commandID);
  if (handler)
  {
    return handler->process(parts);
  }
  LOG_ERROR("No command handler for [%s]", commandID.c_str());
  return COMMAND_FAILED_RESPONSE;
}

void DCCPPProtocolHandler::registerCommand(DCCPPProtocolCommand *cmd)
{
  for (const auto& command : registeredCommands)
  {
    if(!command->getID().compare(cmd->getID()))
    {
      LOG_ERROR("Ignoring attempt to register second command with ID: %s",
        cmd->getID().c_str());
      return;
    }
  }
  LOG(VERBOSE, "Registering interface command %s", cmd->getID().c_str());
  registeredCommands.emplace_back(cmd);
}

DCCPPProtocolCommand *DCCPPProtocolHandler::getCommandHandler(const string &id)
{
  auto command = std::find_if(registeredCommands.begin()
                            , registeredCommands.end()
                            , [id](const unique_ptr<DCCPPProtocolCommand> &cmd)
                              {
                                return cmd->getID() == id;
                              });
  if (command != registeredCommands.end())
  {
    return command->get();
  }
  return nullptr;
}

DCCPPProtocolConsumer::DCCPPProtocolConsumer()
{
  _buffer.resize(256);
}

std::string DCCPPProtocolConsumer::feed(uint8_t *data, size_t len)
{
  for(size_t i = 0; i < len; i++)
  {
    _buffer.emplace_back(data[i]);
  }
  return processData();
}

string DCCPPProtocolConsumer::processData()
{
  auto s = _buffer.begin();
  auto consumed = _buffer.begin();
  string response;
  for(; s != _buffer.end();)
  {
    s = std::find(s, _buffer.end(), '<');
    auto e = std::find(s, _buffer.end(), '>');
    if(s != _buffer.end() && e != _buffer.end())
    {
      // discard the <
      s++;
      // discard the >
      *e = 0;
      std::string str(reinterpret_cast<char*>(&*s));
      response += DCCPPProtocolHandler::process(std::move(str));
      consumed = e;
    }
    s = e;
  }
  // drop everything we used from the buffer.
  _buffer.erase(_buffer.begin(), consumed);
  return response;
}
